#include <stdio.h>

int z13() {
    int n, a = 12953, s, k;

    for (n = a, s = 0; n != 0; n = n / 10) { 
        k = n % 10;
        s = s + k; // В параметре s хранится сумма цифр числа a
    }
    return s;
}

int z14() {
    int n, a = 352, s, k;
    for (n = a, s = 0; n != 0; n = n / 10) {
        k = n % 10;
        if (k > s) s = k; // В параметр s хранится самая большая цифра числа a
    }
}

int z15() {
    int n, a = 5912, s, k;
    for (n = a, s = 0; n != 0; n = n / 10) {
        k = n % 10;
        s = s * 10 + k; // В параметр s хранится число a написанное задом наперёд
    }
}

int z16() {
    int n, a = 2342, s, k, i;
    int A[] = { 1, 2, 3, 4, 5, 6, 7, 8, 9 };
    for (i = 0, n = a; n != 0; i++, n = n / 10);

    for (A[i--] = -1, n = a; n != 0; i--, n = n / 10)

        A[i] = n % 10; // В массиве A записываются цифры числа a по отдельности
}


int z17() {
    int n, a, s, k, j;
    int A[] = { 1, 2, 3, 4, 5, 6, 7, 8, 9 };
    for (j = 0, a = 10; a < 30000; a++) {

        for (n = a, s = 0; n != 0; n = n / 10) {
            k = n % 10;
            s = s + k;
        }

        if (a == s * s * s) A[j++] = a;

    }
}

int z18() {
    int n, a, s, k, v = 20, j;
    int A[] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13 };
    for (j = 0, a = 10; a < v; a++) {

        for (n = a, s = 0; n != 0; n = n / 10) {
            k = n % 10;
            s = s * 10 + k;
        }

        if (a == s) A[j++] = a; // Прибавляет к элементу массива, индекс которого равен первой цифре параметра v, каждый десятый символ параметра v

    }
}

int z19() {
    int n = 10, i, j;
    int A[] = { 1, -2, -3, -4, -5, 6, 7, 8, 9, 1232323, 11 };
    for (i = 0; i < n; i++) {

        if (A[i] < 0) {

            for (j = i; j < n - 1; j++) A[j] = A[j + 1]; // удаляет отрицательные элементы массива А[] и добавляет n - 1-ый элемент массива в n - 1 индекс 

            n--;

            i--;

        }
        printf(A);
    }
}

int z20() {
    int n = 12, k, i, j;
    int A[] = { 11, 10,9,8,7,6,5,4,3,2,1 };
    for (i = 1, k = 0; i < n; i++)

        if (A[i] > A[k]) k = i;

    for (j = k; j < n - 1; j++) A[j] = A[j + 1];

    n--;
}

int z21() {
    int n, a, v = 40, i;
    int A[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
    for (i = 0, a = 2; a < v; a++) {

        for (n = 2; n < a; n++){
            if (a % n == 0)
                break; 
        }

        if (n == a) A[i++] = a; // заполняет массив последовательностью простых чисел, нулевой элемент равен 2

    }

    A[i] = 0;
}

int z22() {
    int n, a, s, v = 40, i;
    int A[] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11 };
    for (i = 0, a = 2; a < v; a++) {

        for (s = 0, n = 2; n < a; n++)

            if (a % n == 0) {
                s = 1;
                break;
            }

        if (s == 0) A[i++] = a; // заполняет массив последовательностью простых чисел, последний элемент равен 0(Обязательное условие - элемент не должен равняться 2)

    }

    A[i] = 0;
}

int z23() {
    int n = 11, a, m, j, i;
    int A[] = { 1, 3, 4, 5, 6, 7, 8, 9, 10, 11 };
    int B[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
    for (j = 0, i = 0; i < n; i++) {

        for (m = 2; m < A[i]; m++){
            if (A[i] % m == 0)
                break;
        }

        if (m == A[i]) 
            B[j++] = A[i]; // заполняет массив B[] последовательностью простых чисел, содержащихся в массиве A[], последний элемент равен 0(Обязательное условие - элемент не должен равняться 2)


    }

    B[j] = 0;
}

int z24() {
    int n = 11, s, m, j, i;
    int A[] = { 1, 3, 4, 5, 6, 7, 8, 9, 10, 11 };
    int B[] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
    for (j = 0, i = 0; i < n; i++) {

        for (s = 0, m = 2; m < A[i]; m++)

            if (A[i] % m == 0) {
                s = 1;
                break;
            }

        if (s == 0) B[j++] = A[i]; // заполняет массив B[] последовательностью простых чисел, содержащихся в массиве A[], последний элемент равен 0(Обязательное условие - элемент не должен равняться 2)


    }

    B[j] = 0;
}

int z25() {
    int n = 7, m, j, i;
    int A[] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11 };
    for (i = 0; i < n; i++) {
        for (m = 2; m < A[i]; m++) {
            if (A[i] % m == 0)
                break;
        }
        if (m == A[i]) {
            for (j = i; j < n - 1; j++) 
                A[j] = A[j + 1];            // заменяет n-ый элемент на число n, n раз(n не должен выходить за границы массива)
            n--;
            i--;
        }
    }
}

int z26() {
    int n = 12, m, s, j, i;
    int A[] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11 };
    for (j = 0, i = 0; i < n; i++) {

        for (s = 0, m = 2; m < A[i]; m++)

            if (A[i] % m == 0) {
                s = 1;
                break;
            }

        if (s == 0) {

            for (j = i; j < n - 1; j++) A[j] = A[j + 1]; printf("%i", A); // удаляет все простые числа и уменьшает длину массива

            n--;

            i--;

        }
    }
}

int main(){
    z26();
}
